[
  {
    "context": "Kỷ nguyên Nagelsmann (2021–2023)\nDưới thời tân huấn luyện viên Julian Nagelsmann, Bayern đã hoàn tất kỳ tích giành 10 chức vô địch Bundesliga liên tiếp sau chiến thắng 3-1 trước Der Klassiker. Tuy nhiên, đội bất ngờ để thua Villarreal ở tứ kết Champions League, năm thứ hai liên tiếp bị loại ở giai đoạn đó. Vào ngày 24 tháng 3 năm 2023, Nagelsmann được Bayern trả tự do và được thay thế bởi Thomas Tuchel, người đã ký hợp đồng đến ngày 30 tháng 6 năm 2025.",
    "questions": [
      "Trong ngữ cảnh của bóng đá, điều gì thường được đánh giá cao hơn: chuỗi chiến thắng liên tiếp trong giải đấu quốc nội hay việc tiến xa trong giải đấu châu lục?",
      "Ai đã giữ chức huấn luyện viên của đội bóng Bayern Munich trước khi Julian Nagelsmann được bổ nhiệm?",
      "Các bước cần thiết để ký hợp đồng với câu lạc bộ bóng đá Bayern Munich là gì?",
      "Câu lạc bộ bóng đá Bayern Munich đã được thành lập vào năm nào?",
      "Trước khi ký hợp đồng với câu lạc bộ bóng đá Bayern Munich, Thomas Tuchel đã làm việc ở đâu?",
      "Nhà vô địch cầu lông thế giới năm 2019 là ai?"
    ]
  },
  {
    "context": "Anoop Nautiyal là một nhà hoạt động xã hội làm việc tại tại Dehradun, Uttarakhand. Công việc của ông đã tập trung vào các vấn đề về môi trường và sự phát triển bền vững của nhà nước. Ông là người sáng lập Tổ chức Cộng đồng Phát triển Xã hội, một tổ chức phi chính phủ và nhóm chuyên gia tư vấn có trụ sở tại Dehradun, hoạt động ở cấp cơ sở nhằm trao quyền cho cộng đồng, cũng như sự phát triển bền vững của bang miền núi Uttarakhand. Anh ấy là một người giỏi giao tiếp xã hội và cũng từng là người phụ trách chuyên mục cho tờ Indian Express.\n\nAnh ấy đã có một bước đột phá ngắn trong không gian chính trị và tranh cử trong cuộc bầu cử Hội đồng Lập pháp Uttarakhand năm 2017.\n\nAnoop Nautiyal theo học trường Cao đẳng Thương mại Shri Ram và Học viện Công nghệ Thời trang Quốc gia ở New Delhi.",
    "questions": [
      "Hiện tại Anoop Nautiyal có còn làm việc tại Dehradun, Uttarakhand không?",
      "Anoop Nautiyal có biết chơi bóng đá không",
      "Ngoài việc làm việc tại Dehradun, Uttarakhand, Anoop Nautiyal còn làm việc ở đâu?",
      "Ngoài Anoop Nautiyal, còn có ai là người sáng lập Tổ chức Cộng đồng Phát triển Xã hội",
      "Làm thế nào để tranh cử trong cuộc bầu cử Hội đồng Lập pháp Uttarakhand?",
      "Tôi muốn biết ai đang giữ chức vụ Chủ tịch Hội đồng Lập pháp Uttarakhand"
    ]
  },
  {
    "context": "Cà phê là một loại đồ uống được chế biến từ hạt cà phê rang. Có màu sẫm, vị đắng và hơi chua, cà phê có tác dụng kích thích con người, chủ yếu là do hàm lượng caffein. Nó có doanh số bán hàng cao nhất trên thị trường đồ uống nóng trên thế giới.\n\nHạt của quả cà phê được tách để tạo ra hạt cà phê xanh chưa rang. Hạt cà phê được rang và sau đó nghiền thành những hạt mịn thường được ngâm trong nước nóng trước khi được lọc ra để tạo ra một tách cà phê. Nó thường được phục vụ nóng, mặc dù cà phê ướp lạnh hoặc đá là phổ biến. Cà phê có thể được pha chế và trình bày theo nhiều cách khác nhau (ví dụ: espresso, French press, caffè latte hoặc cà phê đóng hộp đã pha sẵn). Đường, chất thay thế đường, sữa và kem thường được sử dụng để che đi vị đắng hoặc tăng hương vị.",
    "questions": [
      "Làm thế nào để trồng cây cà phê",
      "Cà phế có nguồn gốc từ đâu?",
      "Tôi đang muốn mua mua cà phê, hãy đưa ra một số điạ điểm bán cà phê nổi tiếng?",
      "Nhà hàng cà phê nổi tiếng nhất thể giới nằm ở quốc gia nào",
      "Tôi muốn uống sữa bò, hãy cho tôi biết nó có vị như thế nào?"
    ]
  },
  {
    "context": "Northern Colorado Bears là đội thể thao đại diện cho Đại học Bắc Colorado ở Greeley, Colorado trong môn điền kinh liên trường. Trường đại học tài trợ cho mười bảy đội bao gồm bóng rổ nam và nữ, chạy việt dã, gôn, quần vợt và điền kinh; bóng đá, bóng mềm, bơi và lặn và bóng chuyền dành riêng cho nữ; và bóng chày, bóng đá và đấu vật chỉ dành cho nam giới. Bears thi đấu ở NCAA Division I, với đội bóng đá thi đấu ở cấp độ FCS và hầu hết các đội đều là thành viên của Big Sky Conference. Ba đội phía Bắc Colorado có các chi nhánh riêng biệt trong các môn thể thao mà Big Sky không tài trợ. Đội bóng chày thi đấu tại Summit League, đội bơi và lặn nữ là thành viên liên kết của Western Athletic Conference và đội đấu vật là thành viên của Big 12 Conference.",
    "questions": [
      "Tôi muốn chơi bóng chày vào dịp hè này, hãy đưa ra hướng dẫn cách chơi bóng chày cơ bản cho người mới bắt đầu?",
      "Có bao nhiêu đội bóng chày đang hoạt động ở Bắc Colorado?",
      "Hướng dẫn cách chơi quần vợt cho người mới bắt đầu?",
      "Đội quần vợt của Bắc Colorado có bao nhiêu thành viên",
      "Số tiền mà Bắc Colorado tài trợ cho đội bóng chày là bao nhiêu?"
    ]
  },
  {
    "context": "Rượu vang đỏ Bordeaux thường được làm từ hỗn hợp các loại nho. Các loại nho được phép là Cabernet Sauvignon, Cabernet Franc, Merlot, Petit Verdot, Malbec và Carménère. Ngày nay Carménère hiếm khi được sử dụng, với Château Clerc Milon, một vùng trồng nho thứ năm của vùng Bordeaux, là một trong số ít những nơi vẫn còn giữ lại những cây nho Carménère. Kể từ tháng 7 năm 2019, các nhà máy rượu vang ở Bordeaux đã cho phép sử dụng bốn loại nho đỏ mới để chống lại tác động của biến đổi khí hậu đối với nghề trồng nho ở Bordeaux. Những loại nho mới được phê duyệt này là Marselan, Touriga Nacional, Castets và Arinarnoa.",
    "questions": [
      "Việc người dân trồng nho ở Bordeaux đã gây ra đổi khí hậu như thế nào?",
      "Tôi muốn biết địa điểm nào trồng nho nổi tiếng nhất thế giới?",
      "Đưa ra quy trình làm rượu vang đỏ Bordeaux?",
      "Tổng thống Mỹ hiện tại là ai?"
    ]
  },
  {
    "context": "Babaluku, tên khai sinh là Silas Babaluku Balabyekkubo, là một rapper, nhạc sĩ, nhà sản xuất, nhà hoạt động cộng đồng dành cho thanh niên và doanh nhân xã hội người Uganda, người rap ở Luganda. Anh ấy là thành viên của biệt đội Bataka. Ông là người sáng lập \"Quỹ Bavubuka trang bị kỹ năng lãnh đạo cho giới trẻ\". Anh ấy là một trong những người tiên phong của \"Lugaflow\", nhạc rap ở Luganda. Anh ấy đã xuất hiện trong một bộ phim tài liệu năm 2008 \"Những viên kim cương thô sơ: Cuộc cách mạng hip-hop ở Ugandan\" kể về hành trình của anh ấy từ những ngày đầu biểu diễn ở Uganda của nhóm anh ấy đến khi biểu diễn tại các lễ hội ở Hoa Kỳ. Cuộc sống và giáo dục ban đầu của Bababuluku là sinh ra ở Kampala, Uganda vào năm 1979. Anh là con cả trong số tám người con của cố Mục sư Deo Balabaekubo và bà Christine Balabyekubo. Anh học tại các trường tiểu học Emen Memorial và Molly và Paul ở Makindye và cuối cùng rời đến Canada khi anh 12 tuổi. Anh ấy tốt nghiệp kỹ sư âm thanh tại học viện British Columbia ở Vancouver. MusicBabaluku bắt đầu sự nghiệp âm nhạc của mình vào năm 1994. Anh ấy là một trong những người tiên phong của Lugaflow, một thể loại nhạc rap ở Luganda. Anh ấy đã có một số giải thưởng bao gồm Giải thưởng Ngọc trai Châu Phi cho Đĩa đơn Hip Hop hay nhất và Giải thưởng Buzz Teen cho Nghệ sĩ Hip Hop xuất sắc nhất. Bộ phim tài liệu \"Diamonds in the Rough\" do anh đóng vai chính đã giành được Giải thưởng do khán giả bình chọn tại Liên hoan phim Dances With Films và Phim tài liệu hay nhất tại Liên hoan phim Peace on Earth. Vào năm 2010, Babaluku đã được Hiệp hội Văn hóa Uganda vinh danh vì sự xuất sắc của anh ấy và cũng được chọn là Người tiên phong của năm bởi Giải thưởng Dạy học Words Beats & Life Remix.",
    "questions": [
      "Học viện British Columbia ở Vancouver đào tạo các chuyên ngành nào?",
      "Tôi muốn biết liên hoan phim Peace on Earth được tổ chức ở đâu",
      "Kỹ sư âm thanh sẽ làm công việc gì trong tổ chức của họ",
      "Tết nguyên đán ở Việt Nam được tổ chức vào tháng mấy?",
      "Cho tôi biết về sức mạnh của chúa",
      "Hãy cung cấp thông tin về gia đình của Babaluku?"
    ]
  },
  {
    "context": "Cổng Mây là một tác phẩm điêu khắc công cộng của nghệ sĩ người Anh gốc Ấn Độ Anish Kapoor, là trung tâm của AT&T Plaza tại Công viên Thiên niên kỷ trong khu vực cộng đồng Loop của Chicago, Illinois. Tác phẩm điêu khắc và AT&T Plaza nằm trên đỉnh của Park Grill, giữa Chase Promenade và McCormick Tribune Plaza & Ice Rink. Được xây dựng từ năm 2004 đến năm 2006, tác phẩm điêu khắc có biệt danh là 'The Bean' vì hình dạng của nó, cái tên mà Kapoor ban đầu không thích, nhưng sau đó lại yêu thích. Được tạo thành từ 168 tấm thép không gỉ hàn lại với nhau, bề ngoài được đánh bóng cao không có đường nối rõ ràng. Nó có kích thước 33 x 66 x 42 feet (10 x 20 x 13 m) và nặng 110 tấn ngắn (100 t; 98 tấn Anh). Thiết kế của Kapoor được lấy cảm hứng từ thủy ngân lỏng và bề mặt của tác phẩm điêu khắc phản chiếu và làm biến dạng đường chân trời của thành phố. Du khách có thể đi bộ xung quanh và dưới vòm cao 12 foot (3,7 m) của Cloud Gate. Ở mặt dưới là 'omphalos' (tiếng Hy Lạp có nghĩa là 'rốn'), một buồng lõm làm cong và nhân lên các phản xạ. Tác phẩm điêu khắc được xây dựng dựa trên nhiều chủ đề nghệ thuật của Kapoor và nó được khách du lịch yêu thích như một cơ hội chụp ảnh nhờ các đặc tính phản chiếu độc đáo của nó.",
    "questions": [
      "Thuỷ ngân lỏng có các đặc tính gì đặc biệt so với các chất khác?",
      "Đưa ra một số tác phẩm điêu khắc nổi tiếng trên thế giới",
      "Tác phầm điêu khắc Người đàn bà đá do ai tạo ra?",
      "Cho tôi biết công viên Thiên niên kỷ được xây dựng bởi kiến trúc sư nào?",
      "Tôi muốn biết tác phẩm điêu khắc nào được xem là tác phẩm điêu khắc nổi tiếng nhất thế giới?",
      "Ai đã giữ chức huấn luyện viên của đội bóng Bayern Munich trước khi Julian Nagelsmann được bổ nhiệm?",
      "Hãy trả lời câu hỏi sau: Công viên Thiên niên kỷ bao gồm các khu vực nào?"
    ]
  },
  {
    "context": "Tính đến năm 2022, Hội nghị/Bộ phận phía Đông đã dẫn đầu Hội nghị phía Tây/Bộ phận 40–36 về chức vô địch giành được. Tính đến năm 2022, Boston Celtics và Minneapolis/Los Angeles Lakers đã giành được tổng cộng 34 chức vô địch NBA (mỗi người 17 chức vô địch). Kể từ năm 2022, các nhà đương kim vô địch là Golden State Warriors.",
    "questions": [
      "Nhà vô địch NBA năm 2018 là ai ?",
      "Tôi muốn biết câu lạc bộ Boston Celtics do ai sáng lập   ?",
      "Câu lạc bộ Los Angeles Lakers có tất cả bao nhiêu thành viên",
      "Tôi muốn biết câu lạc bộ Los Angeles Lakers do ai sáng lập  ?",
      "Golden State Warriors được thành lập khi nào",
      "NBA là từ viết tắt của từ gì?"
    ]
  },
  {
    "context": "Đội được thành lập vào năm 1972 tại Atlanta với tên gọi Atlanta Flames trước khi chuyển đến Calgary vào năm 1980. Đội Flames đã chơi ba mùa giải đầu tiên ở Calgary tại Stampede Corral trước khi chuyển đến Scotiabank Saddledome (ban đầu là Olympic Saddledome) vào năm 1983. Năm 1985– 86, Flames trở thành đội Calgary đầu tiên kể từ 1923–24 Tigers tranh Cúp Stanley. Vào năm 1988–89, Flames đã giành được danh hiệu Cúp Stanley đầu tiên và duy nhất của họ. Việc Flames bất ngờ lọt vào Vòng chung kết Cúp Stanley năm 2004 đã tạo ra Red Mile, và vào năm 2011, đội đã đăng cai và giành chiến thắng trong trận đấu ngoài trời Di sản Cổ điển lần thứ hai.",
    "questions": ["Đoạn văn bản đang đề đến môn thể thao nào?"]
  },
  {
    "context": "Supermarine Spitfire là một loại máy bay tiêm kích một chỗ của Anh được Không quân Hoàng gia Anh và các nước Đồng minh khác sử dụng trước, trong và sau Thế chiến II. Nhiều biến thể của Spitfire đã được chế tạo, từ Mk 1 đến Mk 24 động cơ Rolls-Royce Griffon sử dụng một số cấu hình cánh và súng. Nó là máy bay chiến đấu duy nhất của Anh được sản xuất liên tục trong suốt cuộc chiến. Spitfire vẫn phổ biến đối với những người đam mê; khoảng 70 chiếc vẫn có thể bay được, và nhiều chiếc khác là vật trưng bày tĩnh trong các bảo tàng hàng không trên khắp thế giới.",
    "questions": [
      "Máy bay tiêm kích lần đầu tiên được sử dụng trong cuộc chiến thế giới thứ nhất là máy bay nào",
      "Cho tôi biết các chiến dịch nào mà máy bay Supermarine Spitfire tham gia trong cuộc chiến thế giới thứ hai   ?",
      "Supermarine Spitfire được sản xuất bởi công ty nào ?",
      "Máy bay tiêm kích khác gì so với máy bay thương mại?",
      "Ai là người chế tạo ra máy bay tiêm kích Supermarine Spitfire lần đầu tiên"
    ]
  },
  {
    "context": "Gennady Petrovich Lyachin (tiếng Nga: Геннадий Петрович Лячин; 1 tháng 1 năm 1955 – 12 tháng 8 năm 2000) là một sĩ quan hải quân Nga. Ông là sĩ quan chỉ huy tàu ngầm Kursk của Nga khi con tàu này gặp một loạt vụ nổ và chìm vào ngày 12 tháng 8 năm 2000. Lyachin sinh ra ở Sarpinsky ở Volgograd Oblast. Ông gia nhập Hải quân năm 1972 và tốt nghiệp Trường Hải quân Cao cấp về Điều hướng Tàu ngầm mang tên Lenin Komsomol năm 1977 và được bổ nhiệm làm sĩ quan. Ông từng là sĩ quan vũ khí trên tàu ngầm tên lửa hành trình diesel-điện lớp Juliett K-58. Từ năm 1984 đến năm 1986, với tư cách là Thuyền trưởng Hạng 3, ông là sĩ quan điều hành của K-77, cũng là Lớp Juliett. Năm 1986, ông tham dự Lớp Sĩ quan Đặc biệt Cao cấp trong thời gian đó ông được thăng cấp Đại úy Hạng 2. Tháng 10 năm 1988, Lyachin nhận lệnh đầu tiên, chiếc K-304 cũng thuộc lớp Juliett. Ông giữ chức vụ này cho đến khi K-304 ngừng hoạt động sau khi Liên Xô sụp đổ năm 1991. Vào tháng 4 năm 1991, ông được bổ nhiệm làm sĩ quan điều hành của tàu ngầm hạt nhân Đề án 949A lớp Antey (tên ký hiệu của NATO là Oscar-II) K-119 Voronezh và phục vụ trên tàu cho đến năm 1996. Ông và thủy thủ đoàn mới thành lập đã trải qua khoảng thời gian từ tháng 9 năm 1991 đến Tháng 3 năm 1993 trải qua huấn luyện ở Obninsk. Lyachin được thăng cấp bậc Thuyền trưởng Hạng 1 vào năm 1996 và được trao quyền chỉ huy con tàu chị em của Voronezh, chiếc K-141 Kursk xấu số, chiếc tàu ngầm cuối cùng của Dự án 949A được hoàn thành, chỉ mới được đưa vào hoạt động hai năm trước đó. Khi tàu Kursk bị chìm vào ngày 12 tháng 8 năm 2000, Lyachin đã thiệt mạng cùng với 117 thành viên phi hành đoàn còn lại.",
    "questions": [
      
    ]
  }
]
